Revit 2027 API
FailureHandlingOptions.SetForcedModalHandling Method
 Sets a flag indicating whether Revit will show a modal (blocking) error dialog if the transaction failed to finish.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions SetForcedModalHandling(
	bool bFlag
)
Public Function SetForcedModalHandling (
	bFlag As Boolean
) As FailureHandlingOptions
public:
FailureHandlingOptions^ SetForcedModalHandling(
	bool bFlag
)
member SetForcedModalHandling :
        bFlag : bool -> FailureHandlingOptions
Parameters
bFlag Boolean
 True to force Revit to use a modal error dialog, false to allow a non-blocking dialog for warnings resulting from this transaction.
Return Value
FailureHandlingOptions
 This FailureHandlingOptions object.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace